rssdc-steady-state.log
sequential-fill: (g=0): rw=write, bs=1M-1M/1M-1M/1M-1M, ioengine=libaio, iodepth=16
random-write-steady: (g=1): rw=randwrite, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=32
...
random-read-steady: (g=2): rw=randread, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=32
...
fio-2.2.8
Starting 9 processes

sequential-fill: (groupid=0, jobs=1): err= 0: pid=35645: Thu Jul 27 13:12:32 2017
  Description  : [Sequential fill phase]
  write: io=333861MB, bw=1211.5MB/s, iops=1211, runt=275590msec
    slat (usec): min=36, max=433, avg=102.49, stdev=40.41
    clat (msec): min=1, max=116, avg=13.10, stdev= 4.56
     lat (msec): min=1, max=116, avg=13.21, stdev= 4.56
    clat percentiles (msec):
     |  1.00th=[   13],  5.00th=[   13], 10.00th=[   13], 20.00th=[   13],
     | 30.00th=[   13], 40.00th=[   13], 50.00th=[   13], 60.00th=[   13],
     | 70.00th=[   13], 80.00th=[   13], 90.00th=[   13], 95.00th=[   13],
     | 99.00th=[   15], 99.50th=[   16], 99.90th=[  104], 99.95th=[  106],
     | 99.99th=[  112]
    bw (MB  /s): min=  884, max= 1240, per=100.00%, avg=1212.73, stdev=71.41
    lat (msec) : 2=0.01%, 4=0.01%, 10=0.01%, 20=99.73%, 50=0.01%
    lat (msec) : 100=0.08%, 250=0.18%
  cpu          : usr=2.53%, sys=10.50%, ctx=333940, majf=0, minf=2690
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=333861/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=16
random-write-steady: (groupid=1, jobs=4): err= 0: pid=36337: Thu Jul 27 13:12:32 2017
  Description  : [Random write steady state phase]
  write: io=1304.2GB, bw=589820KB/s, iops=147455, runt=2318495msec
    slat (usec): min=1, max=2053, avg= 3.72, stdev= 0.97
    clat (usec): min=278, max=103877, avg=863.20, stdev=1337.28
     lat (usec): min=281, max=103880, avg=867.03, stdev=1337.28
    clat percentiles (usec):
     |  1.00th=[  430],  5.00th=[  446], 10.00th=[  494], 20.00th=[  572],
     | 30.00th=[  644], 40.00th=[  724], 50.00th=[  796], 60.00th=[  876],
     | 70.00th=[  964], 80.00th=[ 1080], 90.00th=[ 1256], 95.00th=[ 1432],
     | 99.00th=[ 1848], 99.50th=[ 2024], 99.90th=[ 2512], 99.95th=[ 2928],
     | 99.99th=[100864]
    bw (KB  /s): min=73384, max=294000, per=25.01%, avg=147506.61, stdev=29483.36
    lat (usec) : 500=10.79%, 750=32.97%, 1000=29.83%
    lat (msec) : 2=25.85%, 4=0.52%, 10=0.01%, 20=0.01%, 50=0.01%
    lat (msec) : 100=0.01%, 250=0.02%
  cpu          : usr=8.80%, sys=15.86%, ctx=190403917, majf=0, minf=50478
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=341873784/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=32
random-read-steady: (groupid=2, jobs=4): err= 0: pid=40635: Thu Jul 27 13:12:32 2017
  Description  : [Random read steady state phase]
  read : io=1304.2GB, bw=1383.6MB/s, iops=354181, runt=965250msec
    slat (usec): min=1, max=100468, avg= 4.93, stdev=14.50
    clat (usec): min=23, max=103646, avg=322.12, stdev=831.08
     lat (usec): min=64, max=103649, avg=327.19, stdev=832.15
    clat percentiles (usec):
     |  1.00th=[  117],  5.00th=[  145], 10.00th=[  163], 20.00th=[  189],
     | 30.00th=[  213], 40.00th=[  233], 50.00th=[  255], 60.00th=[  278],
     | 70.00th=[  306], 80.00th=[  358], 90.00th=[  572], 95.00th=[  812],
     | 99.00th=[ 1160], 99.50th=[ 1288], 99.90th=[ 1608], 99.95th=[ 1768],
     | 99.99th=[ 2576]
    bw (KB  /s): min=75109, max=791576, per=27.52%, avg=389908.68, stdev=152194.98
    lat (usec) : 50=0.01%, 100=0.18%, 250=47.53%, 500=40.68%, 750=5.36%
    lat (usec) : 1000=4.10%
    lat (msec) : 2=2.13%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
    lat (msec) : 100=0.01%, 250=0.01%
  cpu          : usr=18.43%, sys=51.90%, ctx=29326783, majf=0, minf=42859
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued    : total=r=341873784/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
  WRITE: io=333861MB, aggrb=1211.5MB/s, minb=1211.5MB/s, maxb=1211.5MB/s, mint=275590msec, maxt=275590msec

Run status group 1 (all jobs):
  WRITE: io=1304.2GB, aggrb=589820KB/s, minb=589820KB/s, maxb=589820KB/s, mint=2318495msec, maxt=2318495msec

Run status group 2 (all jobs):
   READ: io=1304.2GB, aggrb=1383.6MB/s, minb=1383.6MB/s, maxb=1383.6MB/s, mint=965250msec, maxt=965250msec

Disk stats (read/write):
  rssdc: ios=345957774/342541506, merge=0/0, ticks=88347176/302166791, in_queue=401385493, util=100.00%