rssdc-steady-state_2.log
random-write-steady: (g=0): rw=randwrite, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=32
...
random-read-steady: (g=1): rw=randread, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=32
...
fio-2.2.8
Starting 64 processes

random-write-steady: (groupid=0, jobs=32): err= 0: pid=3317: Sat Jul 29 10:53:59 2017
  Description  : [Random write steady state phase]
  write: io=31299GB, bw=536998KB/s, iops=134249, runt=61117317msec
    slat (usec): min=2, max=105007, avg=235.99, stdev=718.75
    clat (usec): min=274, max=136358, avg=7384.33, stdev=4281.83
     lat (usec): min=278, max=137850, avg=7620.64, stdev=4362.30
    clat percentiles (msec):
     |  1.00th=[    4],  5.00th=[    5], 10.00th=[    5], 20.00th=[    6],
     | 30.00th=[    7], 40.00th=[    7], 50.00th=[    8], 60.00th=[    8],
     | 70.00th=[    9], 80.00th=[    9], 90.00th=[   10], 95.00th=[   11],
     | 99.00th=[   14], 99.50th=[   16], 99.90th=[  106], 99.95th=[  109],
     | 99.99th=[  111]
    bw (KB  /s): min= 8784, max=317224, per=3.13%, avg=16808.27, stdev=1636.68
    lat (usec) : 500=0.01%, 750=0.01%, 1000=0.01%
    lat (msec) : 2=0.02%, 4=2.25%, 10=36.60%, 20=8.57%, 50=0.07%
    lat (msec) : 100=0.01%, 250=0.14%
  cpu          : usr=1.09%, sys=3.27%, ctx=7030040592, majf=0, minf=1088924
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=47.7%, >=64=0.0%
     submit    : 0=0.0%, 4=47.7%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=47.7%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=8204970816/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=32
random-read-steady: (groupid=1, jobs=32): err= 0: pid=22215: Sat Jul 29 10:53:59 2017
  Description  : [Random read steady state phase]
  read : io=31299GB, bw=1553.7MB/s, iops=397727, runt=20629605msec
    slat (usec): min=1, max=104770, avg=78.14, stdev=413.18
    clat (usec): min=68, max=118149, avg=2490.72, stdev=2274.73
     lat (usec): min=71, max=118446, avg=2569.11, stdev=2312.66
    clat percentiles (usec):
     |  1.00th=[ 1336],  5.00th=[ 1608], 10.00th=[ 1768], 20.00th=[ 2008],
     | 30.00th=[ 2160], 40.00th=[ 2288], 50.00th=[ 2416], 60.00th=[ 2544],
     | 70.00th=[ 2704], 80.00th=[ 2864], 90.00th=[ 3120], 95.00th=[ 3344],
     | 99.00th=[ 3856], 99.50th=[ 4080], 99.90th=[ 5472], 99.95th=[ 9408],
     | 99.99th=[103936]
    bw (KB  /s): min=19640, max=834496, per=3.13%, avg=49821.20, stdev=5078.50
    lat (usec) : 100=0.01%, 250=0.01%, 500=0.02%, 750=0.04%, 1000=0.07%
    lat (msec) : 2=19.68%, 4=27.20%, 10=0.58%, 20=0.01%, 50=0.01%
    lat (msec) : 100=0.01%, 250=0.05%
  cpu          : usr=3.01%, sys=8.98%, ctx=4633914504, majf=0, minf=1028563
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=47.7%, >=64=0.0%
     submit    : 0=0.0%, 4=47.7%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=47.7%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued    : total=r=8204970816/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
  WRITE: io=31299GB, aggrb=536998KB/s, minb=536998KB/s, maxb=536998KB/s, mint=61117317msec, maxt=61117317msec

Run status group 1 (all jobs):
   READ: io=31299GB, aggrb=1553.7MB/s, minb=1553.7MB/s, maxb=1553.7MB/s, mint=20629605msec, maxt=20629605msec

Disk stats (read/write):
  rssdc: ios=8205886842/8204970847, merge=0/0, ticks=855024210/2540559043, in_queue=210884042, util=100.00%